dataset_gen/NS_datasets_16/FPO_cylinder/Regular/Design_Point_0/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16384
(
0.0078125
0.0078125
0.0078125
0.0078125
0.0078125
0.0078125
0.0078125
0.0078125
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.0078125
0.0234375
0.0390625
0.0546875
0.0703125
0.0859375
0.101562
0.117188
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.0078125
0.0234375
0.0390625
0.0546875
0.0703125
0.0859375
0.101562
0.117188
...
)
;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            calculated;
        value           uniform 2;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
