dataset_gen/NS_datasets_16/FPO_cylinder/Regular/Design_Point_0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 16;

vertices
(
    (0 0 0)    // Vertex 0
    (1 0 0)    // Vertex 1
    (1 1 0)    // Vertex 2
    (0 1 0)    // Vertex 3
    (0 0 0.1)  // Vertex 4
    (1 0 0.1)  // Vertex 5
    (1 1 0.1)  // Vertex 6
    (0 1 0.1)  // Vertex 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (128 128 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type            patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type            patch;
        faces
        (
            (1 5 6 2)
        );
    }
    bottom
    {
        type            wall;
        faces
        (
            (0 1 5 4)
        );
    }
    top
    {
        type            wall;
        faces
        (
            (3 7 6 2)
        );
    }
    frontAndBack
    {
        type            empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
